# git - это система управления версиями кода

# github - сайт, который дает хранилище для кода
# так же есть gitlab, bitbucket

# репозиторий - папка с проектом, с которой может работать git 

# ssh-keygen - создание ключа

# git config --global user.name "your-name"
# git config --global user.email "your-email"
# указание своих данных

# git init - превращает папку в репозиторий и создает скрытую папку .git

# Создаете репозиторий на github
# git remote add origin < ссылка на репозиторий > - добавить ссылку на репозиторий в переменную origin

# git add. или filename - добавляет указанные файлы в индекс ( начинает отслеживание файлов )

# git commit -m " название для версии " - создание версии кода ( создать сохранение кода )

"""  git push < ссылка на репозиторий > или переменная origin, которую мы ранее создали -
отправить версию кода на github  """

# git status - проверка состояния

# git log - список коммитов
# git log --oneline - тоже список коммитов в разных форматах

# git clone < ссылка на репозиторий > - скачать проект с репозитория ( склонить проект )


